## Data Structures and Manipulation

In [1]:
# Implement a function to find unique elements from a list and sort them in descending order.

def unique_sorted_descending(input_list):
    # unique elements using set
    unique = set(input_list)
    
    # Sort unique elements in descending order
    sorted_unique_descending = sorted(unique, reverse=True)
    
    return sorted_unique_descending

input_list = [2,6,9,3,7,1,6,9,0,2]
result = unique_sorted_descending(input_list)
print(result)

[9, 7, 6, 3, 2, 1, 0]

In [2]:
# Convert a nested dictionary structure into a flattened dictionary.

def flatten_dict(d, key1='', sep='_'):
    items = []
    for x, y in d.items():
        new_key = key1 + sep + x if key1 else x
        if isinstance(y, dict):
            items.extend(flatten_dict(y, new_key, sep=sep).items())
        else:
            items.append((new_key, y))
    return dict(items)

nested_dict = {
    'person': {
        'name': 'Lokesh',
        'age': 25,
        'address': {
            'city': 'Pune',
            'zip': '411001'
        }
    },
    'company': {
        'name': 'ABC',
        'location': 'bangalore'
    }
}

flattened_dict = flatten_dict(nested_dict)
print(flattened_dict)

#Output- {'person_name': 'Lokesh', 'person_age': 25, 'person_address_city': 'Pune', 'person_address_zip': '411001', 'company_name': 'ABC', 'company_location': 'bangalore'}

{'person_name': 'Lokesh', 'person_age': 25, 'person_address_city': 'Pune', 'person_address_zip': '411001', 'company_name': 'ABC', 'company_location': 'bangalore'}

## Object-Oriented Programming (OOP)

In [1]:
# Define a class Calculator that supports basic arithmetic operations (addition, subtraction, multiplication, division). Include error handling (e.g., division by zero)

#Demonstrate inheritance by extending the Calculator class to a ScientificCalculator that adds trigonometric functions.

import math

class Calculator:
    def add(self, x, y):
        return x + y

    def subtract(self, x, y):
        return x - y

    def multiply(self, x, y):
        return x * y

    def divide(self, x, y):
        try:
            result = x / y
        except ZeroDivisionError:
            return "Error: Division by zero is not allowed"
        return result

class ScientificCalculator(Calculator):
    def sin(self, x):
        return math.sin(x)

    def cos(self, x):
        return math.cos(x)

    def tan(self, x):
        return math.tan(x)

scientific_calc = ScientificCalculator()

# arithmetic operations
print("Addition:", scientific_calc.add(10, 20))  # Output: 30
print("Subtraction:", scientific_calc.subtract(15, 5))  # Output: 10
print("Multiplication:", scientific_calc.multiply(6, 3))  # Output: 18
print("Division:", scientific_calc.divide(10, 2))  # Output: 5
print("Division:", scientific_calc.divide(10, 0))  # Output: Error: Division by zero is not allowed

# Trigonometric functions
print("Sine of 0:", scientific_calc.sin(0))  # Output: 0.0

Addition: 30
Subtraction: 10
Multiplication: 18
Division: 5.0
Division: Error: Division by zero is not allowed
Sine of 0: 0.0

## File I/O

In [5]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

# Read the CSV file
df = pd.read_csv('people.csv')
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Date of birth,Job Title,Age
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,26-10-1945,Games developer,25
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,24-03-1910,Phytotherapist,53
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,02-07-1992,Homeopath,30
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,03-08-2017,Market researcher,32
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,01-12-1938,Veterinary surgeon,56

In [6]:
df.shape   #shows 100 records and 9 columns

(100, 9)

In [7]:
# Clean missing values
df.dropna(inplace=True)

In [9]:
df.shape  #shows 93 records and 9 columns after droping missing values

(93, 9)

In [13]:
# Normalize the 'Age' column
scaler = MinMaxScaler()
df['Age'] = scaler.fit_transform(df[['Age']])

# Display the cleaned and normalized DataFrame
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Date of birth,Job Title,Age
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,26-10-1945,Games developer,0.088235
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,24-03-1910,Phytotherapist,0.911765
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,02-07-1992,Homeopath,0.235294
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,03-08-2017,Market researcher,0.294118
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,01-12-1938,Veterinary surgeon,1.000000

In [14]:
# Write the cleaned data to a new JSON file
df.to_json('cleaned_data.json', orient='records', lines=True)